---
kind: type
id: T:Autodesk.Revit.DB.PageOrientationType
source: html/5d1792e2-758f-3ec3-c1d8-61b186180a2f.htm
---
# Autodesk.Revit.DB.PageOrientationType

An enumerated type listing all Page Orientation types of Print Setting

## Syntax (C#)
```csharp
public enum PageOrientationType
```